def number_to_words(n):
    ones = ["ноль", "один", "два", "три", "четыре", "пять",
            "шесть", "семь", "восемь", "девять",
            "десять", "одиннадцать", "двеннадцать", "тринадцать",
            "четырнадцать", "пятнадцать", "шестнадцать",
            "семьнадцать", "восемьнадцать", "девятнацать"]
    decimals = [" ", " ", "двадцать", "тридцать", "сорок", "пятьдесят",
                "шестьдесят", "семьдесят", "восемьдесят", "девяносто"]
    if int(n) < 20:
        return ones[int(n)]
    else:
        if n % 10 == 0:
            return decimals[n // 10]
        else:
            return decimals[n // 10] + " " + ones[n % 10]


print(number_to_words(4))
print(number_to_words(13))
print(number_to_words(20))
print(number_to_words(31))
